IDENTIFICATION DIVISION.
PROGRAM-ID. SALESRPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A     PIC 9(6)V99 VALUE 1234.50.
01 B     PIC 9(6)V99 VALUE 99.99.
01 C     PIC 9(6)V99 VALUE 12000.00.
01 GRAND PIC 9(7)V99 VALUE 0.
01 P     PIC ZZ,ZZ9.99.
PROCEDURE DIVISION.
    MOVE A TO P.
    DISPLAY "Item 1: $" P.
    MOVE B TO P.
    DISPLAY "Item 2: $" P.
    MOVE C TO P.
    DISPLAY "Item 3: $" P.
    COMPUTE GRAND = A + B + C.
    MOVE GRAND TO P.
    DISPLAY "Total : $" P.
    STOP RUN.
