IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME  PIC X(5) VALUE "World".
01 WS-COUNT PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
    DISPLAY "Hello, " WS-NAME.
    MOVE 5 TO WS-COUNT.
    ADD 10 TO WS-COUNT.
    DISPLAY "Count is " WS-COUNT.
    STOP RUN.
