IDENTIFICATION DIVISION.
PROGRAM-ID. ADVDEMO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 COUNTER PIC 9(4) USAGE COMP VALUE 0.
01 GRADE   PIC 9 VALUE 3.
01 AVG     PIC 9(3) VALUE 0.
01 SRC.
   05 ITEM-A PIC 9(3) VALUE 10.
   05 ITEM-B PIC 9(3) VALUE 20.
01 DST.
   05 ITEM-A PIC 9(3) VALUE 0.
   05 ITEM-B PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
    MOVE CORRESPONDING SRC TO DST.
    DISPLAY "DST A=" ITEM-A OF DST " B=" ITEM-B OF DST.
    EVALUATE GRADE
        WHEN 1 DISPLAY "grade one"
        WHEN 3 DISPLAY "grade three"
        WHEN OTHER DISPLAY "other grade"
    END-EVALUATE.
    COMPUTE AVG ROUNDED = 10 / 3.
    DISPLAY "avg rounded = " AVG.
    MOVE 7 TO COUNTER.
    DISPLAY "counter (comp) = " COUNTER.
    STOP RUN.
