IDENTIFICATION DIVISION.
PROGRAM-ID. LOOPER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I     PIC 9(2) VALUE 0.
01 TOTAL PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM ADD-PARA VARYING I FROM 1 BY 1 UNTIL I > 5.
    DISPLAY "Total is " TOTAL.
    IF TOTAL > 10 THEN
        DISPLAY "big"
    ELSE
        DISPLAY "small"
    END-IF.
    STOP RUN.
ADD-PARA.
    ADD I TO TOTAL.
