IDENTIFICATION DIVISION.
PROGRAM-ID. FEATURES.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS   PIC 9(2) OCCURS 5.
01 I      PIC 9(2) VALUE 0.
01 TOTAL  PIC 9(4) VALUE 0.
01 AGE    PIC 9(3) VALUE 25.
   88 IS-ADULT VALUE 18 THRU 120.
01 RESULT PIC 9(5).
PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        MOVE I TO NUMS(I)
    END-PERFORM.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        ADD NUMS(I) TO TOTAL
    END-PERFORM.
    DISPLAY "Sum of 1..5 is " TOTAL.
    IF IS-ADULT
        DISPLAY "adult"
    END-IF.
    COMPUTE RESULT = (TOTAL + 5) * 2.
    DISPLAY "Computed " RESULT.
    STOP RUN.
