IDENTIFICATION DIVISION.
PROGRAM-ID. STRDEMO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-N PIC X(10) VALUE "JOHN".
01 LAST-N  PIC X(10) VALUE "SMITH".
01 FULL-N  PIC X(30).
01 PART1   PIC X(10).
01 PART2   PIC X(10).
01 CSV     PIC X(20) VALUE "alpha,beta".
01 CNT     PIC 9(3) VALUE 0.
01 TXT     PIC X(15) VALUE "MISSISSIPPI".
01 STARS   PIC X(8).
01 SUB     PIC X(5).
01 NUMTEST PIC X(5) VALUE "12345".
PROCEDURE DIVISION.
    STRING FIRST-N DELIMITED BY SPACE
           " " DELIMITED BY SIZE
           LAST-N DELIMITED BY SPACE
           INTO FULL-N
    END-STRING.
    DISPLAY "Full: [" FULL-N "]".
    UNSTRING CSV DELIMITED BY "," INTO PART1 PART2 END-UNSTRING.
    DISPLAY "Part1: [" PART1 "] Part2: [" PART2 "]".
    MOVE FULL-N(1:4) TO SUB.
    DISPLAY "Refmod: [" SUB "]".
    INSPECT TXT TALLYING CNT FOR ALL "S".
    DISPLAY "S count: " CNT.
    INSPECT TXT REPLACING ALL "S" BY "*".
    DISPLAY "Replaced: " TXT.
    MOVE ALL "*" TO STARS.
    DISPLAY "Stars: " STARS.
    IF NUMTEST IS NUMERIC
        DISPLAY "NUMTEST is numeric"
    END-IF.
    DISPLAY "Upper: " FUNCTION UPPER-CASE("hello world").
    STOP RUN.
