IDENTIFICATION DIVISION.
PROGRAM-ID. MAINPROG.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A      PIC 9(4) VALUE 7.
01 B      PIC 9(4) VALUE 5.
01 RESULT PIC 9(6) VALUE 0.
PROCEDURE DIVISION.
    DISPLAY "Calling ADDER with " A " and " B.
    CALL "ADDER" USING A B RESULT.
    DISPLAY "Result is " RESULT.
    STOP RUN.
END PROGRAM MAINPROG.

IDENTIFICATION DIVISION.
PROGRAM-ID. ADDER.
DATA DIVISION.
LINKAGE SECTION.
01 X PIC 9(4).
01 Y PIC 9(4).
01 Z PIC 9(6).
PROCEDURE DIVISION USING X Y Z.
    COMPUTE Z = X + Y.
    GOBACK.
END PROGRAM ADDER.
